app/views/polls/show.html.erb

	<label style="color:black"><%= @poll.question %></label>
	<% @poll.fields.all.each do |field| %>
---
SELECT "fields".* FROM "fields" WHERE "fields"."poll_id" = 10