app/controllers/polls_controller.rb

  def show
	  @poll = Poll.find(params[:id])
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "4"]]

  def feedback
	  @poll = Poll.find(params[:id])
	  @result = @poll.results.create(field_id: params[:field_id]) #store user data as well
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "15"]]
INSERT INTO "results" ("created_at", "feedback", "field_id", "poll_id", "updated_at", "user_data") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 19 Mar 2013 10:15:27 UTC +00:00], ["feedback", nil], ["field_id", 29], ["poll_id", 15], ["updated_at", Tue, 19 Mar 2013 10:15:27 UTC +00:00], ["user_data", nil]]

  def thankyou
	  @poll = Poll.find(params[:id])
	  @result = Result.find(params[:result][:id])
	  @result.feedback = params[:result][:feedback]
	  @result.save
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", "15"]]
SELECT "results".* FROM "results" WHERE "results"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "results" SET "feedback" = 'some feedback', "updated_at" = '2013-03-19 11:18:24.641749' WHERE "results"."id" = 1